# ChatData

## Sqlite
We are using a file system called **sqlite**. It looks and acts like a real single user relational database (RDB). sqlite3 comes packaged with python. You do not need to install the library. You simply import it (as below).

- We are using Pandas to write and read to sqlite. Pandas will manage a lot of the complexity of dealing with a RDB. There are other ways of reading and writing to a RDB that are VERY common and often used in production systems.  

- The most common other way is to read or write to the RDB row by row. As you can see Pandas puts the entire dataframe into the RDB or extracts a new dataframe from the RDB. These are not row by row operations. These are set operations. Set operations ARE more efficient. However, it is common to use row by row operations to avoid needing large memory computers to hold the dataframes. One row only takes a few bytes. An entire dataframe could be many gigabytes and even petabytes of data. Obviously you will end up with problems with your compute resource if your files are this big. This will not happen to you in this activity and may never happen to you while you are a data analyst. Please just be aware of this. 

- This activity is primarily about querying a RDB, so, we are using a simple way that Pandas provides. If you want to learn the more complex way, just google 'reading and wrting to a relational database using python'. There are many resources to learn from.

- The data types that sqlite supports are quite limited. for example, it does not have a DATE type.  This is not a challenge for this project. However, more sophisticated database systems,such as Postgresql, have a large array of data types, such as "DATE", etc. that give those systems additional capability. 

- All of the SQL queries could also be performed on the Pandas DataFrames directly.  You may want to try this yourself for comparison (but make sure you do the SQL queries first, as this is an exercise in using SQL!).


## SQL Magic
Within the Jupyter notebook we will be using something called **SQL Magic**.  This provides a convenient way to write SQL queries directly into code cells in the notebook and to read the results back into a Pandas DataFrame.  This makes working with SQL much easier!

Note that you may need to update your sqlite version using `conda update -c anaconda sqlite` in order for the SQL Magic to work correctly.

## The Data Analysis Lifecycle
The sections in this notebook follow the stages of the Data Analysis Lifecycle introduced in an earlier activity.  The stages are:

- Acquire
- Transform
- Organise
- Analyse
- Communicate
- Maintain

The requirements document for this project is Template SQL queries.xlsx.

# Preliminary Steps: Create a Database
First let's import Sqlite and the other libraries we will need.

In [1]:
# Import Libraries
import numpy as np
import pandas as pd
import sqlite3

In [2]:
#!pip install ipython-sql

### Create the Database
Now we will create the Sqlite database.  Here is some code that does this for you.  We use the `%load_ext` magic command to load the SQL Magic extension and then use `%sql` to connect to the database.

In [3]:
# If the db does not exist, sqlite will create it.
con = sqlite3.connect('chatdata.db')

# loads sql magic
%load_ext sql 

# connects sql magic command to the correct db
%sql sqlite:///chatdata.db

#### Drop the `queries` table if it already exists
The queries table will be our record of the queries created to answer the questions from the requirements spreadsheet.  As we will be running this Jupyter notebook a few times, let's drop (i.e. remove) the queries table so that we start fresh each time.  Here is the code to do this.  We use the `%%sql` magic command to tell Jupyter that we are going to write SQL in the cell.

In [4]:
%%sql
DROP TABLE IF EXISTS 'queries'

 * sqlite:///chatdata.db
Done.

[]

# Task 1: Load the Data
Now we can start loading the data.  The tables will be created as we load the data.  

Note that some of these files are quite large, so make sure you have plenty of free memory!

## Lifecycle Stages: Transform and Organise
The data has already been processed into 3 clean data files ready for this project:

- queries.csv
- posts.csv
- comments.csv

We will load these files into our database.

## Lifecycle Stage: Acquire
The data can be found in the OpenClassrooms instructions for this activity.

### Load Comments Data into a `comments` table
Now we will load the data from the csv files into our sqlite database.

First we load the csv file into a Pandas dataframe:

In [30]:
comments = pd.read_csv('comments.csv')
comments.head()

,Id,PostId,Score,Text,CreationDate,UserId
0,723182,385124,0,@BenBolker I don't understand. The fit cannot ...,2019-01-01 00:06:39,78575
1,723183,385124,3,"You can't add *less* than (`-min(y)`), but you...",2019-01-01 00:09:22,2126
2,723186,385137,0,nice. If you felt like doing the work it would...,2019-01-01 00:32:11,2126
3,723187,385137,0,"i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,si...",2019-01-01 00:40:36,2126
4,723188,385134,0,"Don't you mean ""so variance should be $\sigma^...",2019-01-01 00:41:28,112141

Now take the comments dataframe and push the data into the Sqlite database table called 'comments':

In [31]:
# load comments into sqlite
comments.to_sql('comments', con, if_exists='replace', index=False)

# read back in to prove that it worked
sql = 'SELECT * FROM comments'
comments = pd.read_sql(sql, con)
comments.head()

,Id,PostId,Score,Text,CreationDate,UserId
0,723182,385124,0,@BenBolker I don't understand. The fit cannot ...,2019-01-01 00:06:39,78575
1,723183,385124,3,"You can't add *less* than (`-min(y)`), but you...",2019-01-01 00:09:22,2126
2,723186,385137,0,nice. If you felt like doing the work it would...,2019-01-01 00:32:11,2126
3,723187,385137,0,"i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,si...",2019-01-01 00:40:36,2126
4,723188,385134,0,"Don't you mean ""so variance should be $\sigma^...",2019-01-01 00:41:28,112141

### Load Other CSVs
Now that you have seen the code for loading in the comments.csv now do the same to read and write the posts.csv and users.csv to sqlite. 

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Enter code in the following cells. Insert as many cells as you want to do this.
    </font></div>

In [20]:
# Read the post data set into a DataFrame
posts = pd.read_csv('posts.csv')

# Explore the first 5 rows
posts.head()

,Id,PostTypeId,AcceptedAnswerId,ParentId,CreationDate,Score,ViewCount,Body,OwnerUserId,OwnerDisplayName,...,LastEditorDisplayName,LastEditDate,LastActivityDate,Title,Tags,AnswerCount,CommentCount,FavoriteCount,ClosedDate,CommunityOwnedDate
0,423497,1,423511,0,2019-08-24 09:39:31,2,68,"<p>From wikipedia <a href=""https://en.wikipedi...",64552,NaN,...,NaN,NaN,2019-08-24 11:38:54,When are biased estimators with lower MSE pref...,<bias><unbiased-estimator><mse>,1,0,1,2019-08-25 10:25:24,NaN
1,423498,1,0,0,2019-08-24 09:47:42,1,24,<p>I am currently doing local sensitivity anal...,87231,NaN,...,NaN,2019-09-06 12:52:32,2019-09-06 12:52:32,How to interpret the result from local sensiti...,<sensitivity-analysis><elasticity>,1,0,0,NaN,NaN
2,423499,1,0,0,2019-08-24 09:48:26,1,56,<p>I'm an honours student in psychology doing ...,257207,NaN,...,NaN,NaN,2019-08-25 08:54:17,Power Analysis in G-Power - Mixed Model Anova,<anova><gpower>,2,0,0,NaN,NaN
3,423500,2,0,215865,2019-08-24 09:57:01,0,0,"<p>Maybe you can look this <a href=""https://me...",106606,NaN,...,NaN,NaN,2019-08-24 09:57:01,NaN,NaN,0,0,0,NaN,NaN
4,423502,2,0,423286,2019-08-24 10:44:52,3,0,<blockquote>\n <p>Q1) Is my approach valid?</...,220643,NaN,...,NaN,2019-08-24 12:13:46,2019-08-24 12:13:46,NaN,NaN,0,1,0,NaN,NaN

In [22]:
#Load posts Dataframe into sqlite
posts.to_sql('posts', con, if_exists='replace',index=False)

#Read back in to prove that it worked
sql = 'SELECT * FROM posts'
posts = pd.read_sql(sql,con)
posts.head()

,Id,PostTypeId,AcceptedAnswerId,ParentId,CreationDate,Score,ViewCount,Body,OwnerUserId,OwnerDisplayName,...,LastEditorDisplayName,LastEditDate,LastActivityDate,Title,Tags,AnswerCount,CommentCount,FavoriteCount,ClosedDate,CommunityOwnedDate
0,423497,1,423511,0,2019-08-24 09:39:31,2,68,"<p>From wikipedia <a href=""https://en.wikipedi...",64552,None,...,None,None,2019-08-24 11:38:54,When are biased estimators with lower MSE pref...,<bias><unbiased-estimator><mse>,1,0,1,2019-08-25 10:25:24,None
1,423498,1,0,0,2019-08-24 09:47:42,1,24,<p>I am currently doing local sensitivity anal...,87231,None,...,None,2019-09-06 12:52:32,2019-09-06 12:52:32,How to interpret the result from local sensiti...,<sensitivity-analysis><elasticity>,1,0,0,None,None
2,423499,1,0,0,2019-08-24 09:48:26,1,56,<p>I'm an honours student in psychology doing ...,257207,None,...,None,None,2019-08-25 08:54:17,Power Analysis in G-Power - Mixed Model Anova,<anova><gpower>,2,0,0,None,None
3,423500,2,0,215865,2019-08-24 09:57:01,0,0,"<p>Maybe you can look this <a href=""https://me...",106606,None,...,None,None,2019-08-24 09:57:01,None,None,0,0,0,None,None
4,423502,2,0,423286,2019-08-24 10:44:52,3,0,<blockquote>\n <p>Q1) Is my approach valid?</...,220643,None,...,None,2019-08-24 12:13:46,2019-08-24 12:13:46,None,None,0,1,0,None,None

In [33]:
# Read the users data set into a DataFrame
users = pd.read_csv('users.csv',parse_dates=True)

#Explore the first 5 rows
users.head()

,Id,Reputation,CreationDate,DisplayName,LastAccessDate,WebsiteUrl,Location,AboutMe,Views,UpVotes,DownVotes,ProfileImageUrl,AccountId
0,157607,31,2017-04-17 14:50:42,user157607,2019-07-23 16:44:08,NaN,NaN,NaN,0,0,0,https://www.gravatar.com/avatar/2efb161849efa4...,10705183
1,157656,101,2017-04-17 20:08:20,user102859,2019-06-26 13:42:13,NaN,NaN,NaN,3,0,0,https://i.stack.imgur.com/eY4ka.jpg?s=128&g=1,10567606
2,157704,133,2017-04-18 05:10:47,jupiar,2019-11-25 13:32:27,NaN,"Shanghai, China","<p>Originally from the U.K, I have an Undergra...",1,1,0,https://www.gravatar.com/avatar/720e20205122c5...,9501631
3,157709,155,2017-04-18 06:39:18,farmer,2019-02-17 19:44:24,NaN,NaN,NaN,16,0,0,https://www.gravatar.com/avatar/0f8c4bde3d8f25...,10709837
4,157755,101,2017-04-18 12:56:17,Miki P,2019-08-12 17:02:21,NaN,NaN,NaN,1,9,0,https://www.gravatar.com/avatar/af088558cd81c5...,7969290

In [34]:
# Read the USER data set into a DataFrame
users.to_sql('users', con, if_exists='replace',index=False)

#Read back in to prove that it worked
sql= 'SELECT * FROM users'
users = pd.read_sql(sql,con)
users.head()

,Id,Reputation,CreationDate,DisplayName,LastAccessDate,WebsiteUrl,Location,AboutMe,Views,UpVotes,DownVotes,ProfileImageUrl,AccountId
0,157607,31,2017-04-17 14:50:42,user157607,2019-07-23 16:44:08,None,None,None,0,0,0,https://www.gravatar.com/avatar/2efb161849efa4...,10705183
1,157656,101,2017-04-17 20:08:20,user102859,2019-06-26 13:42:13,None,None,None,3,0,0,https://i.stack.imgur.com/eY4ka.jpg?s=128&g=1,10567606
2,157704,133,2017-04-18 05:10:47,jupiar,2019-11-25 13:32:27,None,"Shanghai, China","<p>Originally from the U.K, I have an Undergra...",1,1,0,https://www.gravatar.com/avatar/720e20205122c5...,9501631
3,157709,155,2017-04-18 06:39:18,farmer,2019-02-17 19:44:24,None,None,None,16,0,0,https://www.gravatar.com/avatar/0f8c4bde3d8f25...,10709837
4,157755,101,2017-04-18 12:56:17,Miki P,2019-08-12 17:02:21,None,None,None,1,9,0,https://www.gravatar.com/avatar/af088558cd81c5...,7969290

### **TODO**: Drop Duplicates
Look for and drop any duplicates in all 3 of the tables (if they exist). Use Pandas to do this. If you find duplicates, you will need to rewrite the table.

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Enter code in the following cells. 
    </font></div>

In [35]:
#Find duplicates in the comments Dataframe
comments[comments.duplicated()]

Empty DataFrame
Columns: [Id, PostId, Score, Text, CreationDate, UserId]
Index: []

In [36]:
#Find duplicates in the posts Dataframe
posts[posts.duplicated()]

Empty DataFrame
Columns: [Id, PostTypeId, AcceptedAnswerId, ParentId, CreationDate, Score, ViewCount, Body, OwnerUserId, OwnerDisplayName, LastEditorUserId, LastEditorDisplayName, LastEditDate, LastActivityDate, Title, Tags, AnswerCount, CommentCount, FavoriteCount, ClosedDate, CommunityOwnedDate]
Index: []

[0 rows x 21 columns]

In [38]:
#Find duplicates in the users Dataframe
users[users.duplicated()]

Empty DataFrame
Columns: [Id, Reputation, CreationDate, DisplayName, LastAccessDate, WebsiteUrl, Location, AboutMe, Views, UpVotes, DownVotes, ProfileImageUrl, AccountId]
Index: []

## Review the Data

Spend some time reviewing the data.  Understand what data we have, think about how that data can be used to assist in the initiative of understanding how ChatData is used in the real world.  Is the data organised in a way that would lend itself to being manged in a relational database?  How would the different tables be connected?  What are the primary and foreign keys?  Would this give you a 3NF model?

Also think about security and ethics.  Is there personal data in here?  Could individuals be identified through this data?  It it ethical to use the data in this way?  You will be asked to comment on these questions later!

Use the code below to help you.

In [39]:
users.columns

Index(['Id', 'Reputation', 'CreationDate', 'DisplayName', 'LastAccessDate',
       'WebsiteUrl', 'Location', 'AboutMe', 'Views', 'UpVotes', 'DownVotes',
       'ProfileImageUrl', 'AccountId'],
      dtype='object')

In [40]:
users.head()

,Id,Reputation,CreationDate,DisplayName,LastAccessDate,WebsiteUrl,Location,AboutMe,Views,UpVotes,DownVotes,ProfileImageUrl,AccountId
0,157607,31,2017-04-17 14:50:42,user157607,2019-07-23 16:44:08,None,None,None,0,0,0,https://www.gravatar.com/avatar/2efb161849efa4...,10705183
1,157656,101,2017-04-17 20:08:20,user102859,2019-06-26 13:42:13,None,None,None,3,0,0,https://i.stack.imgur.com/eY4ka.jpg?s=128&g=1,10567606
2,157704,133,2017-04-18 05:10:47,jupiar,2019-11-25 13:32:27,None,"Shanghai, China","<p>Originally from the U.K, I have an Undergra...",1,1,0,https://www.gravatar.com/avatar/720e20205122c5...,9501631
3,157709,155,2017-04-18 06:39:18,farmer,2019-02-17 19:44:24,None,None,None,16,0,0,https://www.gravatar.com/avatar/0f8c4bde3d8f25...,10709837
4,157755,101,2017-04-18 12:56:17,Miki P,2019-08-12 17:02:21,None,None,None,1,9,0,https://www.gravatar.com/avatar/af088558cd81c5...,7969290

In [41]:
comments.columns

Index(['Id', 'PostId', 'Score', 'Text', 'CreationDate', 'UserId'], dtype='object')

In [42]:
comments.head()

,Id,PostId,Score,Text,CreationDate,UserId
0,723182,385124,0,@BenBolker I don't understand. The fit cannot ...,2019-01-01 00:06:39,78575
1,723183,385124,3,"You can't add *less* than (`-min(y)`), but you...",2019-01-01 00:09:22,2126
2,723186,385137,0,nice. If you felt like doing the work it would...,2019-01-01 00:32:11,2126
3,723187,385137,0,"i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,si...",2019-01-01 00:40:36,2126
4,723188,385134,0,"Don't you mean ""so variance should be $\sigma^...",2019-01-01 00:41:28,112141

In [43]:
posts.columns

Index(['Id', 'PostTypeId', 'AcceptedAnswerId', 'ParentId', 'CreationDate',
       'Score', 'ViewCount', 'Body', 'OwnerUserId', 'OwnerDisplayName',
       'LastEditorUserId', 'LastEditorDisplayName', 'LastEditDate',
       'LastActivityDate', 'Title', 'Tags', 'AnswerCount', 'CommentCount',
       'FavoriteCount', 'ClosedDate', 'CommunityOwnedDate'],
      dtype='object')

In [44]:
posts.head()

,Id,PostTypeId,AcceptedAnswerId,ParentId,CreationDate,Score,ViewCount,Body,OwnerUserId,OwnerDisplayName,...,LastEditorDisplayName,LastEditDate,LastActivityDate,Title,Tags,AnswerCount,CommentCount,FavoriteCount,ClosedDate,CommunityOwnedDate
0,423497,1,423511,0,2019-08-24 09:39:31,2,68,"<p>From wikipedia <a href=""https://en.wikipedi...",64552,None,...,None,None,2019-08-24 11:38:54,When are biased estimators with lower MSE pref...,<bias><unbiased-estimator><mse>,1,0,1,2019-08-25 10:25:24,None
1,423498,1,0,0,2019-08-24 09:47:42,1,24,<p>I am currently doing local sensitivity anal...,87231,None,...,None,2019-09-06 12:52:32,2019-09-06 12:52:32,How to interpret the result from local sensiti...,<sensitivity-analysis><elasticity>,1,0,0,None,None
2,423499,1,0,0,2019-08-24 09:48:26,1,56,<p>I'm an honours student in psychology doing ...,257207,None,...,None,None,2019-08-25 08:54:17,Power Analysis in G-Power - Mixed Model Anova,<anova><gpower>,2,0,0,None,None
3,423500,2,0,215865,2019-08-24 09:57:01,0,0,"<p>Maybe you can look this <a href=""https://me...",106606,None,...,None,None,2019-08-24 09:57:01,None,None,0,0,0,None,None
4,423502,2,0,423286,2019-08-24 10:44:52,3,0,<blockquote>\n <p>Q1) Is my approach valid?</...,220643,None,...,None,2019-08-24 12:13:46,2019-08-24 12:13:46,None,None,0,1,0,None,None

# Working with Sqlite and SQL Magic
In this section let's spend a little time understanding a bit more about how we can work with Sqlite within Jupyter.

Let's look at 2 ways to query the sqlite database: using SQL Magic or using Pandas.  Either way is fine for this project.

## Writing queries with SQL Magic

You will now need to write some queries to get answers to the questions in the requirements.  

For single-line queries, start the cell with `%sql` and simply enter your query:

In [49]:
# This is an example
%sql SELECT COUNT(*) FROM comments

 * sqlite:///chatdata.db
Done.

[(50000,)]

For multi line sql statements use `%%sql` as follows. This tells Jupyter that *everything* in this cell should be interpreted as sql. So, NO comments other statements are allowed:

In [50]:
%%sql
SELECT Id, PostId, Score, Text
    FROM comments
        LIMIT 5

 * sqlite:///chatdata.db
Done.

[(723182, 385124, 0, '@BenBolker I don\'t understand. The fit cannot be done for the negative $y$. So intuitively I\'d think that in order to retain the relativity of the  ... (24 characters truncated) ... rror" or "flip" it to the positive axis? Would it be possible to adjust every point individually? Basically e.g. take $abs(y_i)$ instead of minimums.'),
 (723183, 385124, 3, "You can't add *less* than (`-min(y)`), but you could add *more*. I'm going to stop answering now sorry, because **judging what the 'best' approach is ... (60 characters truncated) ...  of the analysis, why you need to fit an exponential, your level of computational and statistical sophistication and that of your audience, etc. ...)"),
 (723186, 385137, 0, 'nice. If you felt like doing the work it would be nice to generate an image/contour plot of log-likelihood as a function of (mu, theta) and show the lines corresponding to the two `size` values .'),
 (723187, 385137, 0, 'i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,size=size,log=TRUE)),\n                 xlim=c(2,5),ylim=c(0.2,0.5),\n                 varnames=c("mu","s ... (57 characters truncated) ... ,col="red")\nabline(h=fit.what$theta,col="blue")\n` ... although doesn\'t look this is actually the answer - mu-hat is independent of theta-hat ... ?'),
 (723188, 385134, 0, 'Don\'t you mean "so variance should be $\\sigma^2/(n\\mu^2)$"')]

## Writing queries with Pandas
Another way to write queries is to use pandas:

In [51]:
sql = """
SELECT Id, PostId, Score, Text
    FROM comments
        LIMIT 5
        """
result = pd.read_sql(sql, con)
result

       Id  PostId  Score                                               Text
0  723182  385124      0  @BenBolker I don't understand. The fit cannot ...
1  723183  385124      3  You can't add *less* than (`-min(y)`), but you...
2  723186  385137      0  nice. If you felt like doing the work it would...
3  723187  385137      0  i.e. `emdbook::curve3d(-sum(dnbinom(y,mu=mu,si...
4  723188  385134      0  Don't you mean "so variance should be $\sigma^...

# Creating Tables with Referential Integrity

When we loaded the csv files into Sqlite database tables, Sqlite created the tables for us behind the scenes. Let's inspect this a bit more.

We can see how Sqlite created the tables by querying the `sqlite_master` table, which Sqlite uses to keep track of what objects have been created in the database:

In [52]:
%%sql
select sql from sqlite_master

 * sqlite:///chatdata.db
Done.

[('CREATE TABLE "posts" (\n"Id" INTEGER,\n  "PostTypeId" INTEGER,\n  "AcceptedAnswerId" INTEGER,\n  "ParentId" INTEGER,\n  "CreationDate" TEXT,\n  "Scor ... (240 characters truncated) ...   "Tags" TEXT,\n  "AnswerCount" INTEGER,\n  "CommentCount" INTEGER,\n  "FavoriteCount" INTEGER,\n  "ClosedDate" TEXT,\n  "CommunityOwnedDate" TEXT\n)',),
 ('CREATE TABLE "comments" (\n"Id" INTEGER,\n  "PostId" INTEGER,\n  "Score" INTEGER,\n  "Text" TEXT,\n  "CreationDate" TEXT,\n  "UserId" INTEGER\n)',),
 ('CREATE TABLE "users" (\n"Id" INTEGER,\n  "Reputation" INTEGER,\n  "CreationDate" TEXT,\n  "DisplayName" TEXT,\n  "LastAccessDate" TEXT,\n  "WebsiteUr ... (17 characters truncated) ... tion" TEXT,\n  "AboutMe" TEXT,\n  "Views" INTEGER,\n  "UpVotes" INTEGER,\n  "DownVotes" INTEGER,\n  "ProfileImageUrl" TEXT,\n  "AccountId" INTEGER\n)',)]

The above results show the `CREATE TABLE` statements that could be used by Sqlite to recreate the tables with the exact same structure.

The problem with the CREATE TABLE statements above is that they don't enforce **referential integrity**.  In other words, they don't ensure that every UserId and PostId in the comments table refers to an actual UserId and PostId in the users and posts tables.  At the moment. we can insert any old number here, and even have multiple users with the same Id!  One of the advantages of working with relational databases is that they can enforce the correct uniqueness and relationships in the data, but at the moment we are not using that feature.  So let's fix that...

First, let's drop the original tables:

In [53]:
%%sql
DROP TABLE comments;
DROP TABLE users;
DROP TABLE posts;

 * sqlite:///chatdata.db
Done.
Done.
Done.

[]

Prove that this worked by selecting the names of the tables back.  We should have no tables:

In [54]:
%%sql
SELECT name FROM sqlite_master WHERE type='table'
    ORDER BY name

 * sqlite:///chatdata.db
Done.

[]

In Sqlite we need to enable the enforcement of foreign key constraints:

In [55]:
%%sql
PRAGMA foreign_keys=ON;

 * sqlite:///chatdata.db
Done.

[]

Now recreate the users table with a **primary key constraint** by copying the CREATE TABLE statement from above and adding the NOT NULL PRIMARY KEY clause to the Id:

In [56]:
%%sql
CREATE TABLE "users" (
"Id" INTEGER NOT NULL PRIMARY KEY,
"Reputation" INTEGER,
"CreationDate" TEXT,
"DisplayName" TEXT,
"LastAccessDate" TEXT,
"WebsiteUrl" TEXT,
"Location" TEXT,
"AboutMe" TEXT,
"Views" INTEGER,
"UpVotes" INTEGER,
"DownVotes" INTEGER,
"ProfileImageUrl" TEXT,
"AccountId" INTEGER
);

 * sqlite:///chatdata.db
Done.

[]

Now do the same for the posts table:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

In [ ]:
# Run the CREATE TABLE statement for the posts table, including the primary key constraint

In [81]:
#%%sql
#DROP TABLE posts

In [82]:
%%sql
CREATE TABLE "posts" (
"Id" INTEGER NOT NULL PRIMARY KEY,
"PostTypeId" INTEGER,
"AcceptedAnswerId" INTEGER,
"ParentId" INTEGER,
"CreationDate" TEXT,
"Score" INTEGER,
"ViewCount" INTEGER,
"Body" TEXT,
"OwnerUserId" INTEGER,
"OwnerDisplayName" TEXT,
"LastEditorUserId" INTEGER,
"LastEditorDisplayName" TEXT,
"LastEditDate" TEXT,
"LastActivityDate" TEXT,
"Title" TEXT,
"Tags" TEXT,
"AnswerCount" INTEGER,
"CommentCount" INTEGER,
"FavoriteCount" INTEGER,
"ClosedDate" TEXT,
"CommunityOwnedDate" TEXT,
FOREIGN KEY(OwnerUserId) REFERENCES users(Id)
);

 * sqlite:///chatdata.db
(sqlite3.OperationalError) table "posts" already exists
[SQL: CREATE TABLE "posts" (
"Id" INTEGER NOT NULL PRIMARY KEY,
"PostTypeId" INTEGER,
"AcceptedAnswerId" INTEGER,
"ParentId" INTEGER,
"CreationDate" TEXT,
"Score" INTEGER,
"ViewCount" INTEGER,
"Body" TEXT,
"OwnerUserId" INTEGER,
"OwnerDisplayName" TEXT,
"LastEditorUserId" INTEGER,
"LastEditorDisplayName" TEXT,
"LastEditDate" TEXT,
"LastActivityDate" TEXT,
"Title" TEXT,
"Tags" TEXT,
"AnswerCount" INTEGER,
"CommentCount" INTEGER,
"FavoriteCount" INTEGER,
"ClosedDate" TEXT,
"CommunityOwnedDate" TEXT,
FOREIGN KEY(OwnerUserId) REFERENCES users(Id)
);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

Now for the comments table.  We need to add the primary key constraint on the id here as we did for users and posts, but we also need to add FOREIGN KEY constraints on the UserId and PostId. Read the documentation here and find our how to do that: https://www.sqlite.org/foreignkeys.html.  Then create the comments table with the correct constraints:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

In [ ]:
# Run the CREATE TABLE statement for the comments table, including the primary key constraint and the 2 foreign key constraints
# TODO

In [58]:
%%sql
CREATE TABLE "comments" (
"Id" INTEGER PRIMARY KEY,
"PostId" INTEGER,
"Score" INTEGER,
"Text" TEXT,
"CreationDate" TEXT,
"UserId" INTEGER,
 FOREIGN KEY(PostId) REFERENCES posts(Id),
 FOREIGN KEY(UserId) REFERENCES users(Id)
);

 * sqlite:///chatdata.db
Done.

[]

Now we can re-insert the data into these constrained tables.  First users:

In [59]:
# Insert data into the new users table
users.to_sql('users', con, if_exists='append', index=False)

18412

Now posts:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

In [60]:
# Insert data into the new posts table
posts.to_sql('posts',con,if_exists='append',index=False)

42234

Finally comments, which references the users and posts tables:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

In [61]:
# Insert data into the new comments table
comments.to_sql('comments',con,if_exists='append',index=False)

50000

Now check that we have the 3 new table definitions in Sqlite:

In [62]:
%%sql
SELECT name FROM sqlite_master WHERE type='table'
    ORDER BY name

 * sqlite:///chatdata.db
Done.

[('comments',), ('posts',), ('users',)]

We now have all the data in tables in Sqlite and the tables will enforce the referential integrity.

# Example Query and Pattern for Tasks 2 and 3

As you work through the next tasks, you will need to:

1. Prepare the Sqlite query to answer the question
2. Test it
3. Insert it into the `queries` table, so we have a record of it for others.

This is the process that we want you to follow for this project while completing it.

Let's see an example of this by answering the following question:

**Which 5 users have viewed the most times and what is the sum of those views per user?**

## Prepare the Sqlite query

First, let's write the query:

In [63]:
sql = """
SELECT Id, SUM(Views) AS TotalViews
    FROM Users
        GROUP BY Id
            ORDER BY TotalViews DESC
                LIMIT 5
                """
result = pd.read_sql(sql, con) # con is the connection to the database
result

     Id  TotalViews
0   919       85180
1  4253       35119
2   805       34637
3  7290       32639
4  3277       29255

## Test the query
You can optionally prove the query worked by performing the same query in Pandas:

In [64]:
results = users.groupby(['Id']).sum().sort_values('Views', ascending = False)[:5]
results['Views']

Id
919     85180
4253    35119
805     34637
7290    32639
3277    29255
Name: Views, dtype: int64

## Insert the query into the `queries` table
Now we need to put this query into the `queries` table in sqlite. Remember we want these queries to be accessible to everybody that should have access to them. We do not want people writing and rewriting the same queires over and over again. The easiest thing to do is create a dictionary with the values and insert these into the queries table.  Note that the values are provided as lists as we are inserting a list of values (i.e. a number of rows) into the table.  In this case the number of rows is 1, so we have lists of 1 item.

So here, we have a column called 'task' with a list of values, a column called 'action' with a list of values, etc.

In [65]:
query_dict = {
              'task': ['Single Table Queries'],
              'action': ['Which 5 users have viewed the most times and what is the sum of those views per user?'],
              'query': [sql]
             }
query_dict

{'task': ['Single Table Queries'],
 'action': ['Which 5 users have viewed the most times and what is the sum of those views per user?'],
 'query': ['\nSELECT Id, SUM(Views) AS TotalViews\n    FROM Users\n        GROUP BY Id\n            ORDER BY TotalViews DESC\n                LIMIT 5\n                ']}

Now that you have the data structure (query_dict) containing the data, create a pandas dataframe that holds those values:

In [66]:
queries = pd.DataFrame(query_dict)
queries

,task,action,query
0,Single Table Queries,Which 5 users have viewed the most times and w...,"\nSELECT Id, SUM(Views) AS TotalViews\n FRO..."

Now load that pandas dataframe (queries) into the sqlite table called queries. In this case, you use append NOT replace. You will be adding to this tables as you go thru this project.

In [67]:
# load query into sqlite
queries.to_sql('queries', con, if_exists='append', index=False)

# read back in to prove that it worked
sql = 'SELECT * FROM queries'
queries = pd.read_sql(sql, con)
queries.head()

,task,action,query
0,Single Table Queries,Which 5 users have viewed the most times and w...,"\nSELECT Id, SUM(Views) AS TotalViews\n FRO..."

It is likely that as you iterate thru this notebook you will create some duplicate entries in the query table. Not a big deal. Just tell sql or pandas (much easier in pandas) to drop the duplicates! If you drop the duplicates in Pandas you will have to write the entire dataframe back to sqlite. Otherwise it is changed in memory in Pandas but NOT in sqlite on the disk drive (or SDD). Just do this drop at the end of this notebook so that you are not constantly dealing with this.

So, to summarise, as you go through the following tasks you need to:

- answer the question in sql
- prove it in pandas (if you want to)
- put the query into the queries table

# Task 1 (continued): Insert the CREATE TABLE Statements into the `queries` Table

Now that we understand how to populate the `queries` table, let's insert the CREATE TABLE statements into it.  First let's define a function to help us insert into the queries table:

In [72]:
# Define a function that will insert into the queries table
def store_query(task, action, query):
    query_dict = {
                  'task': [task],
                  'action': [action],
                  'query': [query]
                 }

    # put query into the query_dict
    queries = pd.DataFrame(query_dict)

    # load query into sqlite
    queries.to_sql('queries', con, if_exists='append', index=False)

Now we can specify the queries and call the above function to store them.  The first one is done for you.

In [73]:
sql = """
    CREATE TABLE "comments" (
    "Id" INTEGER,
    "PostId" INTEGER,
    "Score" INTEGER,
    "Text" TEXT,
    "CreationDate" TEXT,
    "UserId" INTEGER
    )
    """
store_query("Task 1", "Create table comments", sql)

Let's prove it works by selecting back from the queries table:

In [74]:
# Prove it works
%sql SELECT * FROM queries

 * sqlite:///chatdata.db
Done.

[('Single Table Queries', 'Which 5 users have viewed the most times and what is the sum of those views per user?', '\nSELECT Id, SUM(Views) AS TotalViews\n    FROM Users\n        GROUP BY Id\n            ORDER BY TotalViews DESC\n                LIMIT 5\n                '),
 ('Task 1', 'Create table comments', '\n    CREATE TABLE "comments" (\n    "Id" INTEGER,\n    "PostId" INTEGER,\n    "Score" INTEGER,\n    "Text" TEXT,\n    "CreationDate" TEXT,\n    "UserId" INTEGER\n    )\n    '),
 ('Task 1', 'Create table comments', '\n    CREATE TABLE "comments" (\n    "Id" INTEGER,\n    "PostId" INTEGER,\n    "Score" INTEGER,\n    "Text" TEXT,\n    "CreationDate" TEXT,\n    "UserId" INTEGER\n    )\n    ')]

## Insert the other CREATE TABLE statements into the `queries` table.
Follow the above pattern to complete these code cells:

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cells
    </font></div>

In [75]:
# Insert the CREATE TABLE for posts into the queries table
sql = """
    CREATE TABLE "posts" (
        "Id" INTEGER NOT NULL PRIMARY KEY,
        "PostTypeId" INTEGER,
        "AcceptedAnswerId" INTEGER,
        "ParentId" INTEGER,
        "CreationDate" TEXT,
        "Score" INTEGER,
        "ViewCount" INTEGER,
        "Body" TEXT,
        "OwnerUserId" INTEGER,
        "OwnerDisplayName" TEXT,
        "LastEditorUserId" INTEGER,
        "LastEditorDisplayName" TEXT,
        "LastEditDate" TEXT,
        "LastActivityDate" TEXT,
        "Title" TEXT,
        "Tags" TEXT,
        "AnswerCount" INTEGER,
        "CommentCount" INTEGER,
        "FavoriteCount" INTEGER,
        "ClosedDate" TEXT,
        "CommunityOwnedDate" TEXT,
        FOREIGN KEY(OwnerUserId) REFERENCES users(Id)
        )
    """
store_query("Task 1", "Create table posts", sql)

In [76]:
# Insert the CREATE TABLE for users into the queries table
sql = """
    CREATE TABLE "users" (
        "Id" INTEGER NOT NULL PRIMARY KEY,
        "Reputation" INTEGER,
        "CreationDate" TEXT,
        "DisplayName" TEXT,
        "LastAccessDate" TEXT,
        "WebsiteUrl" TEXT,
        "Location" TEXT,
        "AboutMe" TEXT,
        "Views" INTEGER,
        "UpVotes" INTEGER,
        "DownVotes" INTEGER,
        "ProfileImageUrl" TEXT,
        "AccountId" INTEGER
        )
    """
store_query("Task 1", "Create table users", sql)

In [77]:
# Confirm that the data is stored
sql="""
     SELECT * FROM queries
    """
queries=pd.read_sql(sql,con)
queries

,task,action,query
0,Single Table Queries,Which 5 users have viewed the most times and w...,"\nSELECT Id, SUM(Views) AS TotalViews\n FRO..."
1,Task 1,Create table comments,"\n CREATE TABLE ""comments"" (\n ""Id"" INTE..."
2,Task 1,Create table comments,"\n CREATE TABLE ""comments"" (\n ""Id"" INTE..."
3,Task 1,Create table posts,"\n CREATE TABLE ""posts"" (\n ""Id"" INT..."
4,Task 1,Create table users,"\n CREATE TABLE ""users"" (\n ""Id"" INT..."

## Count the Number of Rows in Each Table
Run some queries to count the number of rows in each of the tables.  Don't forget to insert the query into the queries table.

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cells
    </font></div>

In [83]:
# Count the number of rows in the comments table
sql = """
    SELECT count(*) 
    FROM "comments" 
    """
count_row_comments=pd.read_sql(sql,con)
store_query("Task 1", "Count the number of rows in the comments table", sql)
count_row_comments

   count(*)
0     50000

In [84]:
%%sql
DELETE FROM queries WHERE action = "Run the query to select 5 random rows from the posts table"

 * sqlite:///chatdata.db
0 rows affected.

[]

In [85]:
# Count the number of rows in the users table
sql = """
    SELECT count(*) 
    FROM "users" 
    """
count_row_users=pd.read_sql(sql,con)
store_query("Task 1", "Count the number of rows in the users table", sql)
count_row_users

   count(*)
0     18412

In [86]:
# Count the number of rows in the posts table
sql = """
    SELECT count(*) 
    FROM "posts" 
    """
count_row_posts=pd.read_sql(sql,con)
store_query("Task 1", "Count the number of rows in the posts table", sql)
count_row_users

   count(*)
0     18412

## Do some Random Checks on the Data
Let's write some queries that select 5 random rows from each table.  The queries are provided here:

    select * from Comments order by random() limit 5;
    select * from Users order by random() limit 5;
    select * from Posts order by random() limit 5;

Enter the queries into the code cells below and insert the queries into the `queries` table in the same was as you did for the CREATE TABLE statements.

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cells
    </font></div>

In [8]:
# Run the query to select 5 random rows from the comments table

%%sql
SELECT * FROM comments 
ORDER BY RANDOM() 
LIMIT 5;

SyntaxError: invalid syntax (239578101.py, line 4)

In [9]:
# Run the query to select 5 random rows from the posts comments
%%sql
SELECT * FROM posts 
ORDER BY RANDOM() 
LIMIT 5;

SyntaxError: invalid syntax (77995286.py, line 3)

In [7]:
# Run the query to select 5 random rows from the users table
%%sql
SELECT * FROM users 
ORDER BY RANDOM() 
LIMIT 5;

SyntaxError: invalid syntax (1026295550.py, line 3)

# Task 2: Create Single Table Queries

## Lifecycle Stage: Analyze
We can now start the analysis with our single-table queries.  First we need to create a new computed column to help with one of the queries.  The code below creates a column called LEN_BODY which is the length of the BODY text:

In [109]:
%%sql
ALTER TABLE POSTS ADD COLUMN LEN_BODY INT

 * sqlite:///chatdata.db
Done.

[]

In [110]:
%%sql
UPDATE POSTS SET LEN_BODY = LENGTH(BODY)

 * sqlite:///chatdata.db
42234 rows affected.

[]

### Single Table Queries
From the Template SQL Queries there are a series of queries requested. You are responsible for coding the result. Use the pattern above to accomplish the coding objective.  Copy and paste the question (column B Action) into a markdown cell and answer the query. Use the pattern that you have been using above. 

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Enter your code below.  Just keep on inserting cells as you need them.
    </font></div>

In [111]:
%%sql
SELECT count(*) as Count FROM posts WHERE CommentCount = 0;

 * sqlite:///chatdata.db
Done.

[(21713,)]

In [113]:
# Confirm using Pandas

count=posts[posts['CommentCount']==0]
len(count)

21713

In [114]:
# insert the queries into the queries table 
sql ="""
    SELECT count(*) as Count FROM posts 
    WHERE CommentCount = 0;
    """
store_query('task 2','How many posts have 0 comments',sql)

How many posts have 1 comments?

In [115]:
%%sql
SELECT count(*) as Count FROM posts WHERE CommentCount = 1;

 * sqlite:///chatdata.db
Done.

[(6460,)]

In [116]:
# Confirm using Pandas
count=posts[posts['CommentCount']==1]
len(count)

6460

In [117]:
# insert the queries into the queries table 
sql ="""
    SELECT count(*) as Count FROM posts 
    WHERE CommentCount = 1;
    """
store_query('task 2','How many posts have 1 comments',sql)

HOW MANY POSTS HAVE 2 COMMENTS OR MORE?

In [118]:
%%sql
SELECT count(*) as Count FROM posts WHERE CommentCount >= 2;

 * sqlite:///chatdata.db
Done.

[(14061,)]

In [119]:
# Confirm using Pandas
count=posts[posts['CommentCount']>=2]
len(count)

14061

In [120]:
# insert the queries into the queries table 
sql ="""
    SELECT count(*) as Count FROM posts 
    WHERE CommentCount >= 2;
    """
store_query('task 2','How many posts have 2 comments or more',sql)

FIND THE 5 POSTS WITH THE HIGHEST VIEW COUNT

In [121]:
%%sql 
SELECT * FROM posts 
    ORDER BY ViewCount DESC
        LIMIT 5;

 * sqlite:///chatdata.db
Done.

[(388566, 1, 388582, 0, '2019-01-22 15:16:47', 56, 19542, '<ul>\n<li>Statement One (S1): "One in 80 deaths is caused by a car accident."</li>\n<li>Statement Two (S2): "One in 80 people dies as a result of a c ... (2000 characters truncated) ...  interpretation (their default for S2 is a much stronger assumption), or if they have some innate statistical sense that I\'m in fact lacking. </p>\n', 228214, None, 164061, None, '2019-01-22 21:40:39', '2019-01-24 17:09:47', 'Is it wrong to rephrase "1 in 80 deaths is caused by a car accident" as "1 in 80 people die as a result of a car accident?"', '<interpretation><risk>', 9, 15, 15, None, None, 2270),
 (394118, 1, 394128, 0, '2019-02-24 14:07:11', 64, 16317, '<p>A human child at age 2 needs around 5 instances of a car to be able to identify it with reasonable accuracy regardless of color, make, etc. When m ... (217 characters truncated) ... >What is it that artificial neural networks are missing that prevent them from being able to learn way quicker? Is transfer learning an answer?</p>\n', 107213, None, 7291, None, '2019-02-25 22:40:22', '2019-03-03 17:37:05', 'Why do neural networks need so many training examples to perform?', '<neural-networks><neuroscience>', 12, 24, 38, None, None, 512),
 (431370, 1, 431397, 0, '2019-10-14 11:29:21', 77, 11723, '<p>It seems very counter intuitive to many people that a given diagnostic test with very high accuracy (say 99%) can generate massively more false po ... (520 characters truncated) ... lp me explain it to a lay person.</p>\n\n<p>Apologies if this is the wrong forum to ask this. If so please direct me to a more appropriate one.</p>\n', 262594, None, 11887, None, '2019-11-28 01:44:34', '2019-11-28 01:44:34', 'Is there a name for the phenomenon of false positives counterintuitively outstripping true positives', '<probability><terminology><intuition>', 8, 9, 18, None, None, 811),
 (398646, 1, 398653, 0, '2019-03-21 01:19:52', 61, 9850, '<p>The title of the Comment in Nature <a href="https://www.nature.com/articles/d41586-019-00857-9" rel="noreferrer">Scientists rise up against statis ... (1880 characters truncated) ... pft.jpg" rel="noreferrer"><img src="https://i.stack.imgur.com/tgpft.jpg" alt="Nature: Scientists rise up against statistical significance"></a></p>\n', 163067, None, 163067, None, '2019-03-22 22:14:04', '2019-03-30 19:35:27', 'What does "Scientists rise up against statistical significance" mean? (Comment in Nature)', '<statistical-significance><p-value><bias>', 10, 7, 34, None, None, 2148),
 (434128, 1, 434579, 0, '2019-11-01 13:07:36', 73, 6718, '<p>I am designing a one year program in data analysis with a local community college. The program aims to prepare students to handle basic tasks in d ... (891 characters truncated) ... ur in the area of variable selection and sampling design. I\'m interested in paradoxes that occur in other areas -- like the analysis as such. </p>\n', 14188, None, 0, None, None, '2019-11-26 00:59:15', 'Famous statistical wins and horror stories for teaching purposes', '<mathematical-statistics><data-visualization><experiment-design><teaching>', 13, 7, 70, None, '2019-11-01 15:12:41', 1172)]

In [122]:
# Confirm using Pandas
posts.sort_values(by='ViewCount',ascending=False)[:5]

,Id,PostTypeId,AcceptedAnswerId,ParentId,CreationDate,Score,ViewCount,Body,OwnerUserId,OwnerDisplayName,...,LastEditorDisplayName,LastEditDate,LastActivityDate,Title,Tags,AnswerCount,CommentCount,FavoriteCount,ClosedDate,CommunityOwnedDate
2756,388566,1,388582,0,2019-01-22 15:16:47,56,19542,"<ul>\n<li>Statement One (S1): ""One in 80 death...",228214,None,...,None,2019-01-22 21:40:39,2019-01-24 17:09:47,"Is it wrong to rephrase ""1 in 80 deaths is cau...",<interpretation><risk>,9,15,15,None,None
7166,394118,1,394128,0,2019-02-24 14:07:11,64,16317,<p>A human child at age 2 needs around 5 insta...,107213,None,...,None,2019-02-25 22:40:22,2019-03-03 17:37:05,Why do neural networks need so many training e...,<neural-networks><neuroscience>,12,24,38,None,None
36077,431370,1,431397,0,2019-10-14 11:29:21,77,11723,<p>It seems very counter intuitive to many peo...,262594,None,...,None,2019-11-28 01:44:34,2019-11-28 01:44:34,Is there a name for the phenomenon of false po...,<probability><terminology><intuition>,8,9,18,None,None
10833,398646,1,398653,0,2019-03-21 01:19:52,61,9850,<p>The title of the Comment in Nature <a href=...,163067,None,...,None,2019-03-22 22:14:04,2019-03-30 19:35:27,"What does ""Scientists rise up against statisti...",<statistical-significance><p-value><bias>,10,7,34,None,None
38317,434128,1,434579,0,2019-11-01 13:07:36,73,6718,<p>I am designing a one year program in data a...,14188,None,...,None,None,2019-11-26 00:59:15,Famous statistical wins and horror stories for...,<mathematical-statistics><data-visualization><...,13,7,70,None,2019-11-01 15:12:41

In [123]:
# insert the queries into the queries table 
sql ="""
    SELECT * FROM posts 
    ORDER BY ViewCount DESC
    LIMIT 5;
    """
store_query('task 2','Find the 5 posts with the highest viewcount',sql)

FIND THE TOP 5 POSTS WITH THE HIGHEST SCORES

In [124]:
%%sql 
SELECT * FROM posts 
    ORDER BY Score DESC
        LIMIT 5;

 * sqlite:///chatdata.db
Done.

[(431397, 2, 0, 431370, '2019-10-14 14:29:36', 101, 0, '<p>Yes there is. Generally it is termed <strong>base rate fallacy</strong> or more specific <strong>false positive paradox</strong>. There is even a wikipedia article about it: <a href="https://en.wikipedia.org/wiki/Base_rate_fallacy" rel="noreferrer">see here</a></p>\n', 142976, None, 0, None, None, '2019-10-14 14:29:36', None, None, 0, 0, 0, None, None, 269),
 (394128, 2, 0, 394118, '2019-02-24 15:44:44', 100, 0, '<p>I caution against expecting strong resemblance between biological and artificial neural networks. I think the name "neural networks" is a bit dang ... (5584 characters truncated) ... l volume, diversity and resolution of the training data.</p>\n\n<p>*We don\'t presently have a tags for one-shot learning or few-shot learning.</p>\n', 22311, None, 22311, None, '2019-03-03 17:37:05', '2019-03-03 17:37:05', None, None, 0, 15, 0, None, None, 5829),
 (426878, 2, 0, 426873, '2019-09-11 23:23:31', 93, 0, '<p><strong>tl;dr</strong> Even though this is an image classification dataset, it remains a <strong>very easy</strong> task, for which one can easily ... (4424 characters truncated) ... and out more\n    frame1 = plt.gca()\n    frame1.axes.get_xaxis().set_visible(False)\n    frame1.axes.get_yaxis().set_visible(False)\n</code></pre>\n', 119015, None, 119015, None, '2019-09-13 14:02:28', '2019-09-13 14:02:28', None, None, 0, 6, 0, None, None, 4627),
 (388578, 2, 0, 388566, '2019-01-22 15:48:47', 80, 0, '<p>To me "1 in 80 deaths..." is by far the clearer statement.  The denominator in your "1 in 80" is the set of all death events and that statement ma ... (282 characters truncated) ... rence set in probability or frequency assertions like this. If you\'re talking about the proportion of deaths, then say "deaths" not "people". </p>\n', 227039, None, 0, None, None, '2019-01-22 15:48:47', None, None, 0, 11, 0, None, None, 572),
 (431370, 1, 431397, 0, '2019-10-14 11:29:21', 77, 11723, '<p>It seems very counter intuitive to many people that a given diagnostic test with very high accuracy (say 99%) can generate massively more false po ... (520 characters truncated) ... lp me explain it to a lay person.</p>\n\n<p>Apologies if this is the wrong forum to ask this. If so please direct me to a more appropriate one.</p>\n', 262594, None, 11887, None, '2019-11-28 01:44:34', '2019-11-28 01:44:34', 'Is there a name for the phenomenon of false positives counterintuitively outstripping true positives', '<probability><terminology><intuition>', 8, 9, 18, None, None, 811)]

In [126]:
# insert the queries into the queries table 
sql ="""
    SELECT * FROM posts 
    ORDER BY Score DESC
    LIMIT 5;
    """
store_query('task 2','Find the 5 posts with the highest scores',sql)

WHAT ARE THE 5 MOST RECENT SCORES ON POSTS?

In [127]:
%%sql 
SELECT Score ,count(*) as count FROM posts 
    GROUP BY Score
        ORDER BY count DESC
            LIMIT 5;

 * sqlite:///chatdata.db
Done.

[(0, 19888), (1, 11867), (2, 5094), (3, 2228), (4, 1059)]

In [128]:
# Confirm using Pandas
posts.groupby("Score").count().sort_values(by='Id',ascending=False)['Id'][0:5]

Score
0    19888
1    11867
2     5094
3     2228
4     1059
Name: Id, dtype: int64

In [129]:
# insert the queries into the queries table 
sql ="""
    SELECT Score ,count(*) as count FROM posts 
    GROUP BY Score
    ORDER BY count DESC
    LIMIT 5;
    """
store_query('task 2','What are the 5 most frequent scores on posts',sql)

HOW MANY POSTS HAVE THE KEYWORD 'DATA' IN THEIR TAGS?

In [130]:
%%sql 
SELECT count(*) as count FROM posts 
    WHERE Tags LIKE "%data%";

 * sqlite:///chatdata.db
Done.

[(2242,)]

In [131]:
# Confirm using Pandas
len(posts[posts['Tags'].str.contains('data')==True])

2242

In [132]:
# insert the queries into the queries table 
sql ="""
    SELECT count(*) as count FROM posts 
    WHERE Tags LIKE "%data%";
    """
store_query('task 2','How many posts have the keyword "data" in their tags',sql)

WHAT ARE THE 5 MOSTS FREQUENT COMMENT COUNT FOR POSTS?

In [133]:
%%sql 
SELECT CommentCount ,count(*) as count FROM posts 
    GROUP BY CommentCount
        ORDER BY count DESC
            LIMIT 5;

 * sqlite:///chatdata.db
Done.

[(0, 21713), (1, 6460), (2, 4966), (3, 3063), (4, 2026)]

In [134]:
# Confirm using Pandas
posts.groupby("CommentCount").count().sort_values(by='Id',ascending=False)['Id'][0:5]

CommentCount
0    21713
1     6460
2     4966
3     3063
4     2026
Name: Id, dtype: int64

In [135]:
# insert the queries into the queries table 
sql ="""
    SELECT CommentCount ,count(*) as count FROM posts 
    GROUP BY CommentCount
    ORDER BY count DESC
    LIMIT 5;
    """
store_query('task 2','What are the 5 most frequent commentcount for posts',sql)

HOW MANY POSTS HAVE AN ACCEPTED ANSWER?

In [136]:
%%sql
SELECT count(*) as Count FROM posts WHERE AcceptedAnswerId <> 0;

 * sqlite:///chatdata.db
Done.

[(5341,)]

In [137]:
# Confirm using Pandas
len(posts[posts['AcceptedAnswerId']!=0])

5341

In [138]:
# insert the queries into the queries table 
sql ="""
    SELECT count(*) as Count FROM posts 
    WHERE AcceptedAnswerId <> 0;
        """
store_query('task 2','How many posts have an accepted answer',sql)

WHAT IS THE AVERAGE REPUTATION OF TABLE USERS?

In [139]:
%%sql
SELECT ROUND(AVG(Reputation),2) as AverageReputation FROM users;

 * sqlite:///chatdata.db
Done.

[(312.35,)]

In [140]:
# Confirm using Pandas
round(users['Reputation'].mean(),2)

312.35

In [141]:
# insert the queries into the queries table 
sql ="""
    SELECT ROUND(AVG(Reputation),2) as AverageReputation FROM users;
    """
store_query('task 2','What is the average reputation of table users',sql)

WHAT ARE THE MIN AND MAX REPUTATION OF USERS?

In [142]:
%%sql
SELECT ROUND(MIN(Reputation),2) as MinReputation,
ROUND(MAX(Reputation),2) as MaxReputation FROM users;

 * sqlite:///chatdata.db
Done.

[(1.0, 228662.0)]

In [143]:
# Confirm using Pandas
round(users['Reputation'].min(),2),round(users['Reputation'].max(),2)

(1, 228662)

In [144]:
# insert the queries into the queries table 
sql ="""
    SELECT ROUND(MIN(Reputation),2) as MinReputation,
    ROUND(MAX(Reputation),2) as MaxReputation FROM users;
    """
store_query('task 2','What are the min and max reputation of users',sql)

WHAT IS THE LENGHT OF THE BODY OF THE 5 MOST VIEWED POSTS?

In [145]:
%%sql
SELECT ViewCount as MostViewed ,Len_Body as LengthBody FROM posts
    ORDER BY ViewCount DESC
        LIMIT 5;

 * sqlite:///chatdata.db
Done.

[(19542, 2270), (16317, 512), (11723, 811), (9850, 2148), (6718, 1172)]

In [146]:
# Confirm using Pandas
post=pd.read_sql("""Select * From posts""",con)
post[['ViewCount','LEN_BODY']].sort_values(by='ViewCount',ascending=False)[0:5]

       ViewCount  LEN_BODY
2695       19542    2270.0
7105       16317     512.0
36077      11723     811.0
10772       9850    2148.0
38317       6718    1172.0

In [147]:
# insert the queries into the queries table 
sql ="""
    SELECT ViewCount as MostViewed ,Len_Body as LengthBody FROM posts
    ORDER BY ViewCount DESC
    LIMIT 5;
    """
store_query('task 2','What is the length of the body of 5 most viewed posts',sql)

HOW MANY DIFFERENT LOCATIONS ARE THERE IN THE USER TABLE?

In [148]:
%%sql
SELECT count(DISTINCT(location)) as LocationCount FROM (
    SELECT * FROM users 
        GROUP BY location
    );

 * sqlite:///chatdata.db
Done.

[(1900,)]

In [149]:
# Confirm using Pandas
users['Location'].nunique()

1900

In [150]:
# insert the queries into the queries table 
sql ="""
    SELECT count(DISTINCT(location)) as LocationCount FROM (
    SELECT * FROM users 
        GROUP BY location
    );
    """
store_query('task 2','How many different locations are there in the users table',sql)

WHAT ARE THE TOP 5 LOCATION OF USERS?

In [151]:
%%sql
SELECT Location,count(*) as LocationCount FROM users
    GROUP BY Location
        ORDER BY LocationCount DESC
            LIMIT 5;

 * sqlite:///chatdata.db
Done.

[(None, 13335),
 ('Germany', 117),
 ('India', 100),
 ('United States', 69),
 ('Paris, France', 66)]

In [152]:
# Confirm using Pandas
users.groupby('Location',dropna=False).count().sort_values('Id',ascending=False)['Id'][0:5]

Location
NaN              13335
Germany            117
India              100
United States       69
Paris, France       66
Name: Id, dtype: int64

In [153]:
# insert the queries into the queries table 
sql ="""
    SELECT Location,count(*) as LocationCount FROM users
    GROUP BY Location
    ORDER BY LocationCount DESC
    LIMIT 5;
    """
store_query('task 2','What are the top 5 locations of users',sql)

RANK THE DAYS OF THE WEEK FROM HIGHEST TO LOWEST IN TERMS OF THE VOLUME OF VIEW COUNT AS A %

In [154]:
%%sql
SELECT  CASE 
            WHEN WeekDayNumber = 0 THEN 'Sunday'
            WHEN WeekDayNumber = 1 THEN 'Monday'
            WHEN WeekDayNumber = 2 THEN 'Tuesday'
            WHEN WeekDayNumber = 3 THEN 'Wednesday'
            WHEN WeekDayNumber = 4 THEN 'Thursday'
            WHEN WeekDayNumber = 5 THEN 'Friday'
            ELSE 'Saturday' 
    END as WeekDay,Percentage_ViewCount
FROM (SELECT CAST (strftime('%w', CreationDate) AS INTEGER) as WeekDayNumber,
           round( cast(sum(ViewCount) as float)/cast((select sum(ViewCount) from posts)as float) *100.0,2) as Percentage_ViewCount 
FROM posts   
GROUP BY WeekDayNumber
ORDER BY Percentage_ViewCount DESC)

 * sqlite:///chatdata.db
Done.

[('Thursday', 16.82),
 ('Wednesday', 16.77),
 ('Tuesday', 16.26),
 ('Monday', 15.81),
 ('Friday', 13.56),
 ('Sunday', 11.9),
 ('Saturday', 8.89)]

In [155]:
# Confirm using Pandas
post['CreationDate']=pd.to_datetime(post.CreationDate, format='%Y-%m-%d %H:%M:%S')
post['week']=post['CreationDate'].dt.dayofweek
sum=post.groupby('week')['ViewCount'].sum()
sum2=sum.sum()
newsum=sum/sum2*100
round(newsum.sort_values(ascending=False),2)

week
3    16.82
2    16.77
1    16.26
0    15.81
4    13.56
6    11.90
5     8.89
Name: ViewCount, dtype: float64

In [156]:
# insert the queries into the queries table 
sql ="""
SELECT  CASE 
            WHEN WeekDayNumber = 0 THEN 'Sunday'
            WHEN WeekDayNumber = 1 THEN 'Monday'
            WHEN WeekDayNumber = 2 THEN 'Tuesday'
            WHEN WeekDayNumber = 3 THEN 'Wednesday'
            WHEN WeekDayNumber = 4 THEN 'Thursday'
            WHEN WeekDayNumber = 5 THEN 'Friday'
            ELSE 'Saturday' 
    END as WeekDay,Percentage_ViewCount
FROM (SELECT CAST (strftime('%w', CreationDate) AS INTEGER) as WeekDayNumber,
           round( cast(sum(ViewCount) as float)/cast((select sum(ViewCount) from posts)as float) *100.0,2) as Percentage_ViewCount 
FROM posts   
GROUP BY WeekDayNumber
ORDER BY Percentage_ViewCount DESC);
    """
store_query('task 2','Rank the days of the week from highest to lowest in terms of the volume of ViewCount as a percentage',sql)

# Task 3: Cross Table Queries

## Lifecycle Stage: Analyze
Let's continue the analysis with our multi-table queries.

### Cross Table Queries

From the Template SQL Queries there are a series of queries requested. You are responsible for coding the result. Use the pattern above to accomplish the coding objective.  Copy and paste the question (column B Action) into a markdown cell and answer the query. Use the pattern that you have been using above. 

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Enter your code below.  Just keep on inserting cells as you need them.
    </font></div>

In [157]:
%%sql
SELECT count(*) FROM users
INNER JOIN posts ON posts.OwnerUserId = users.Id
WHERE AboutMe <> "NULL";

 * sqlite:///chatdata.db
Done.

[(17189,)]

In [158]:
# Confirm using Pandas
mergeT= posts.merge(users,how='inner',left_on='OwnerUserId',right_on='Id')
len(mergeT[mergeT['AboutMe'].notnull()])

17189

In [159]:
# insert the queries into the queries table 
sql ="""
    SELECT count(*) FROM users
    INNER JOIN posts ON posts.OwnerUserId = users.Id
    WHERE AboutMe <> "NULL";
    """
store_query('task 3','How many posts have been created by a user that has a filled out the "AboutMe" section',sql)

Considering only the users with an "AboutMe," how many posts are there per user?

In [160]:
%%sql
SELECT (count(Posts.Id))/(count(DISTINCT users.Id)) as PostPerUser FROM users
INNER JOIN posts ON posts.OwnerUserId = users.Id
WHERE AboutMe <> "NULL"

 * sqlite:///chatdata.db
Done.

[(5,)]

In [161]:
# Confirm using Pandas
(mergeT[mergeT['AboutMe'].notnull()]).groupby('OwnerUserId')['PostTypeId'].count()

OwnerUserId
-1         1
 22        2
 25        4
 29        1
 104       1
          ..
 267133    1
 267172    1
 267205    1
 267232    1
 267322    1
Name: PostTypeId, Length: 3366, dtype: int64

In [162]:
# insert the queries into the queries table 
sql ="""
   SELECT OwnerUserId,count(*) 
    FROM (SELECT * FROM users
    INNER JOIN posts ON posts.OwnerUserId = users.Id
    WHERE AboutMe <> "NULL")
    GROUP BY OwnerUserId;
    """
store_query('task 3','Considering only the users with an "AboutMe," how many posts are there per user',sql)

Not taking into account the commentcount field in the table posts, what are the Top 10 posts in terms of number of comments?

In [163]:
%%sql
   SELECT PostId,count(comments.Id) as NumberComments FROM posts
    LEFT OUTER JOIN comments ON posts.Id = comments.PostId
    GROUP BY PostId
    ORDER BY NumberComments DESC
    LIMIT 10;

 * sqlite:///chatdata.db
Done.

[(386853, 66),
 (386556, 34),
 (418910, 31),
 (395232, 31),
 (402987, 27),
 (386075, 26),
 (394118, 24),
 (402950, 23),
 (398828, 23),
 (396111, 22)]

In [164]:
# Confirm using Pandas
mergeT= posts.merge(comments,how='left',left_on='Id',right_on='PostId')
top=mergeT.groupby('PostId').count()['Text'].sort_values(ascending=False)
top.iloc[0:10]

PostId
386853.0    66
386556.0    34
395232.0    31
418910.0    31
402987.0    27
386075.0    26
394118.0    24
402950.0    23
398828.0    23
396111.0    22
Name: Text, dtype: int64

In [165]:

# insert the queries into the queries table 
sql ="""
    SELECT PostId,count(comments.Id) as NumberComments FROM posts
    LEFT OUTER JOIN comments ON posts.Id = comments.PostId
    GROUP BY PostId
    ORDER BY NumberComments DESC
    LIMIT 10;
    """
store_query('task 3','Not taking into account the commentcount field in the table posts, what are the Top 10 posts in terms of number of comments?',sql)

What are the Top 10 posts which have the highest cummulative (post score + comment score) score?

In [166]:
%%sql
  SELECT PostId,(TotalComScore + TotalPostScore ) as CummScore FROM
    (SELECT PostId,sum(comments.score) as TotalComScore ,sum(posts.score) as TotalPostScore FROM posts
    INNER JOIN comments ON posts.Id = comments.PostId
    GROUP BY PostId,posts.Score
    ORDER BY TotalComScore DESC
    LIMIT 10)
    ORDER BY CummScore DESC;

 * sqlite:///chatdata.db
Done.

[(394118, 1778),
 (394128, 1569),
 (398653, 1021),
 (388578, 941),
 (388566, 885),
 (398646, 465),
 (421677, 392),
 (420526, 317),
 (386571, 197),
 (393336, 125)]

In [167]:
# Confirm using Pandas
mergeT= posts.merge(comments,how='left',left_on='Id',right_on='PostId')
top=mergeT.groupby('PostId').sum()[['Score_x','Score_y']]
top['CummScore']=top['Score_x']+top['Score_y']
top10=top['CummScore'].sort_values(ascending=False)
top10.iloc[:10]

PostId
394118.0    1778.0
394128.0    1569.0
418910.0    1094.0
398653.0    1021.0
388578.0     941.0
388566.0     885.0
396818.0     808.0
418814.0     621.0
394258.0     570.0
394439.0     566.0
Name: CummScore, dtype: float64

In [168]:
# insert the queries into the queries table 
sql ="""
    SELECT PostId,(TotalComScore + TotalPostScore ) as CummScore FROM
    (SELECT PostId,sum(comments.score) as TotalComScore ,sum(posts.score) as TotalPostScore FROM posts
    LEFT OUTER JOIN comments ON posts.Id = comments.PostId
    GROUP BY PostId
    ORDER BY TotalComScore DESC
    LIMIT 10)
    ORDER BY CummScore DESC;
    """
store_query('task 3','Not taking into account the commentcount field in the table posts, what are the Top 10 posts in terms of number of comments?',sql)

Who are the top 10 users who comment the most?

In [169]:
%%sql
SELECT UserId, users.Reputation,count(PostId) as PostsNum, count(Text) as NumComments FROM users
    LEFT OUTER JOIN comments ON users.Id = comments.UserId
    GROUP BY UserId
    ORDER BY NumComments DESC,PostsNum DESC
    LIMIT 10;

 * sqlite:///chatdata.db
Done.

[(919, 223056, 3301, 3301),
 (805, 228662, 1153, 1153),
 (143489, 2890, 1024, 1024),
 (11887, 39200, 805, 805),
 (85665, 17391, 691, 691),
 (164061, 13485, 540, 540),
 (22047, 41385, 536, 536),
 (158565, 6482, 504, 504),
 (7962, 8030, 492, 492),
 (35989, 71548, 470, 470)]

In [170]:
# Confirm using Pandas
mergeT= users.merge(comments,how='left',left_on='Id',right_on='UserId')
top=mergeT.groupby('UserId').count()['PostId'].sort_values(ascending=False)
top.iloc[0:10]

UserId
919.0       3301
805.0       1153
143489.0    1024
11887.0      805
85665.0      691
164061.0     540
22047.0      536
158565.0     504
7962.0       492
35989.0      470
Name: PostId, dtype: int64

In [171]:
# insert the queries into the queries table 
sql ="""
    SELECT UserId, users.Reputation,count(PostId) as PostsNum, count(Text) as NumComments FROM users
    LEFT OUTER JOIN comments ON users.Id = comments.UserId
    GROUP BY UserId
    ORDER BY PostsNum DESC
    LIMIT 10;
    """
store_query('task 3','Who are the top 10 users who comment the most?',sql)

Who are the top 10 users who post the most?

In [172]:
%%sql
SELECT UserId, users.Reputation,count(PostId) as PostsNum FROM users
    LEFT OUTER JOIN comments ON users.Id = comments.UserId
    GROUP BY UserId
    ORDER BY  PostsNum DESC ,users.Reputation DESC
    LIMIT 10

 * sqlite:///chatdata.db
Done.

[(919, 223056, 3301),
 (805, 228662, 1153),
 (143489, 2890, 1024),
 (11887, 39200, 805),
 (85665, 17391, 691),
 (164061, 13485, 540),
 (22047, 41385, 536),
 (158565, 6482, 504),
 (7962, 8030, 492),
 (35989, 71548, 470)]

# Task 4: Check the Queries Table

Now let's tidy up and check the queries table.

First let's check it's contents:

In [173]:
%sql SELECT * FROM queries

 * sqlite:///chatdata.db
Done.

[('Single Table Queries', 'Which 5 users have viewed the most times and what is the sum of those views per user?', '\nSELECT Id, SUM(Views) AS TotalViews\n    FROM Users\n        GROUP BY Id\n            ORDER BY TotalViews DESC\n                LIMIT 5\n                '),
 ('Task 1', 'Create table comments', '\n    CREATE TABLE "comments" (\n    "Id" INTEGER,\n    "PostId" INTEGER,\n    "Score" INTEGER,\n    "Text" TEXT,\n    "CreationDate" TEXT,\n    "UserId" INTEGER\n    )\n    '),
 ('Task 1', 'Create table comments', '\n    CREATE TABLE "comments" (\n    "Id" INTEGER,\n    "PostId" INTEGER,\n    "Score" INTEGER,\n    "Text" TEXT,\n    "CreationDate" TEXT,\n    "UserId" INTEGER\n    )\n    '),
 ('Task 1', 'Create table posts', '\n    CREATE TABLE "posts" (\n        "Id" INTEGER NOT NULL PRIMARY KEY,\n        "PostTypeId" INTEGER,\n        "AcceptedAnswerId" INTEGER,\n        ... (465 characters truncated) ... unt" INTEGER,\n        "ClosedDate" TEXT,\n        "CommunityOwnedDate" TEXT,\n        FOREIGN KEY(OwnerUserId) REFERENCES users(Id)\n        )\n    '),
 ('Task 1', 'Create table users', '\n    CREATE TABLE "users" (\n        "Id" INTEGER NOT NULL PRIMARY KEY,\n        "Reputation" INTEGER,\n        "CreationDate" TEXT,\n        "Displ ... (138 characters truncated) ... ws" INTEGER,\n        "UpVotes" INTEGER,\n        "DownVotes" INTEGER,\n        "ProfileImageUrl" TEXT,\n        "AccountId" INTEGER\n        )\n    '),
 ('Task 1', 'Count the number of rows in the comments table', '\n    SELECT count(*) \n    FROM "comments" \n    '),
 ('Task 1', 'Count the number of rows in the users table', '\n    SELECT count(*) \n    FROM "users" \n    '),
 ('Task 1', 'Count the number of rows in the posts table', '\n    SELECT count(*) \n    FROM "posts" \n    '),
 ('task 2', 'How many posts have 0 comments', '\n    SELECT count(*) as Count FROM posts \n    WHERE CommentCount = 0;\n    '),
 ('task 2', 'How many posts have 1 comments', '\n    SELECT count(*) as Count FROM posts \n    WHERE CommentCount = 1;\n    '),
 ('task 2', 'How many posts have 2 comments or more', '\n    SELECT count(*) as Count FROM posts \n    WHERE CommentCount >= 2;\n    '),
 ('task 2', 'Find the 5 posts with the highest viewcount', '\n    SELECT * FROM posts \n    ORDER BY ViewCount DESC\n    LIMIT 5;\n    '),
 ('task 2', 'Find the 5 posts with the highest scores', '\n    SELECT * FROM posts \n    ORDER BY Score DESC\n    LIMIT 5;\n    '),
 ('task 2', 'Find the 5 posts with the highest scores', '\n    SELECT * FROM posts \n    ORDER BY Score DESC\n    LIMIT 5;\n    '),
 ('task 2', 'What are the 5 most frequent scores on posts', '\n    SELECT Score ,count(*) as count FROM posts \n    GROUP BY Score\n    ORDER BY count DESC\n    LIMIT 5;\n    '),
 ('task 2', 'How many posts have the keyword "data" in their tags', '\n    SELECT count(*) as count FROM posts \n    WHERE Tags LIKE "%data%";\n    '),
 ('task 2', 'What are the 5 most frequent commentcount for posts', '\n    SELECT CommentCount ,count(*) as count FROM posts \n    GROUP BY CommentCount\n    ORDER BY count DESC\n    LIMIT 5;\n    '),
 ('task 2', 'How many posts have an accepted answer', '\n    SELECT count(*) as Count FROM posts \n    WHERE AcceptedAnswerId <> 0;\n        '),
 ('task 2', 'What is the average reputation of table users', '\n    SELECT ROUND(AVG(Reputation),2) as AverageReputation FROM users;\n    '),
 ('task 2', 'What are the min and max reputation of users', '\n    SELECT ROUND(MIN(Reputation),2) as MinReputation,\n    ROUND(MAX(Reputation),2) as MaxReputation FROM users;\n    '),
 ('task 2', 'What is the length of the body of 5 most viewed posts', '\n    SELECT ViewCount as MostViewed ,Len_Body as LengthBody FROM posts\n    ORDER BY ViewCount DESC\n    LIMIT 5;\n    '),
 ('task 2', 'How many different locations are there in the users table', '\n    SELECT count(DISTINCT(location)) as LocationCount FROM (\n    SELECT * FROM users \n        GROUP BY location\n    );\n    '),
 ('task 2', 'What are the top 5 locations of users', '\n    SELECT Location,count(*) as LocationCount FROM users\n    GROUP BY Location\n    ORDER BY LocationCount DESC\n    LIMIT 5;\n    '),
 ('task 2', 'Rank the days of the week from highest to lowest in terms of the volume of ViewCount as a percentage', "\nSELECT  CASE \n            WHEN WeekDayNumber = 0 THEN 'Sunday'\n            WHEN WeekDayNumber = 1 THEN 'Monday'\n            WHEN WeekDayNumber = ... (389 characters truncated) ... ViewCount) from posts)as float) *100.0,2) as Percentage_ViewCount \nFROM posts   \nGROUP BY WeekDayNumber\nORDER BY Percentage_ViewCount DESC);\n    "),
 ('task 3', 'How many posts have been created by a user that has a filled out the "AboutMe" section', '\n    SELECT count(*) FROM users\n    INNER JOIN posts ON posts.OwnerUserId = users.Id\n    WHERE AboutMe <> "NULL";\n    '),
 ('task 3', 'Considering only the users with an "AboutMe," how many posts are there per user', '\n   SELECT OwnerUserId,count(*) \n    FROM (SELECT * FROM users\n    INNER JOIN posts ON posts.OwnerUserId = users.Id\n    WHERE AboutMe <> "NULL")\n    GROUP BY OwnerUserId;\n    '),
 ('task 3', 'Not taking into account the commentcount field in the table posts, what are the Top 10 posts in terms of number of comments?', '\n    SELECT PostId,count(comments.Id) as NumberComments FROM posts\n    LEFT OUTER JOIN comments ON posts.Id = comments.PostId\n    GROUP BY PostId\n    ORDER BY NumberComments DESC\n    LIMIT 10;\n    '),
 ('task 3', 'Not taking into account the commentcount field in the table posts, what are the Top 10 posts in terms of number of comments?', '\n    SELECT PostId,(TotalComScore + TotalPostScore ) as CummScore FROM\n    (SELECT PostId,sum(comments.score) as TotalComScore ,sum(posts.score) as ... (42 characters truncated) ...  JOIN comments ON posts.Id = comments.PostId\n    GROUP BY PostId\n    ORDER BY TotalComScore DESC\n    LIMIT 10)\n    ORDER BY CummScore DESC;\n    '),
 ('task 3', 'Who are the top 10 users who comment the most?', '\n    SELECT UserId, users.Reputation,count(PostId) as PostsNum, count(Text) as NumComments FROM users\n    LEFT OUTER JOIN comments ON users.Id = comments.UserId\n    GROUP BY UserId\n    ORDER BY PostsNum DESC\n    LIMIT 10;\n    ')]

## Drop Duplicates

You likely have some duplicates. Lets drop them.

In [174]:
# Read the queries table into pandas
sql = 'SELECT * FROM queries'
queries = pd.read_sql(sql, con)

# Drop duplicates
queries.drop_duplicates(inplace = True) # drop duplicates

## Case Issues

Remember, SQL is case insensitive. Pandas IS case sensitive. Lets deal with this now by making all of the text uppercase.

In [175]:
for col in queries.columns:
    queries[col] = queries[col].str.upper()
    
queries

,task,action,query
0,SINGLE TABLE QUERIES,WHICH 5 USERS HAVE VIEWED THE MOST TIMES AND W...,"\nSELECT ID, SUM(VIEWS) AS TOTALVIEWS\n FRO..."
1,TASK 1,CREATE TABLE COMMENTS,"\n CREATE TABLE ""COMMENTS"" (\n ""ID"" INTE..."
3,TASK 1,CREATE TABLE POSTS,"\n CREATE TABLE ""POSTS"" (\n ""ID"" INT..."
4,TASK 1,CREATE TABLE USERS,"\n CREATE TABLE ""USERS"" (\n ""ID"" INT..."
5,TASK 1,COUNT THE NUMBER OF ROWS IN THE COMMENTS TABLE,"\n SELECT COUNT(*) \n FROM ""COMMENTS"" \n..."
6,TASK 1,COUNT THE NUMBER OF ROWS IN THE USERS TABLE,"\n SELECT COUNT(*) \n FROM ""USERS"" \n"
7,TASK 1,COUNT THE NUMBER OF ROWS IN THE POSTS TABLE,"\n SELECT COUNT(*) \n FROM ""POSTS"" \n"
8,TASK 2,HOW MANY POSTS HAVE 0 COMMENTS,\n SELECT COUNT(*) AS COUNT FROM POSTS \n ...
9,TASK 2,HOW MANY POSTS HAVE 1 COMMENTS,\n SELECT COUNT(*) AS COUNT FROM POSTS \n ...
10,TASK 2,HOW MANY POSTS HAVE 2 COMMENTS OR MORE,\n SELECT COUNT(*) AS COUNT FROM POSTS \n ...
11,TASK 2,FIND THE 5 POSTS WITH THE HIGHEST VIEWCOUNT,\n SELECT * FROM POSTS \n ORDER BY VIEWC...
12,TASK 2,FIND THE 5 POSTS WITH THE HIGHEST SCORES,\n SELECT * FROM POSTS \n ORDER BY SCORE...
14,TASK 2,WHAT ARE THE 5 MOST FREQUENT SCORES ON POSTS,"\n SELECT SCORE ,COUNT(*) AS COUNT FROM POS..."
15,TASK 2,"HOW MANY POSTS HAVE THE KEYWORD ""DATA"" IN THEI...",\n SELECT COUNT(*) AS COUNT FROM POSTS \n ...
16,TASK 2,WHAT ARE THE 5 MOST FREQUENT COMMENTCOUNT FOR ...,"\n SELECT COMMENTCOUNT ,COUNT(*) AS COUNT F..."
17,TASK 2,HOW MANY POSTS HAVE AN ACCEPTED ANSWER,\n SELECT COUNT(*) AS COUNT FROM POSTS \n ...
18,TASK 2,WHAT IS THE AVERAGE REPUTATION OF TABLE USERS,"\n SELECT ROUND(AVG(REPUTATION),2) AS AVERA..."
19,TASK 2,WHAT ARE THE MIN AND MAX REPUTATION OF USERS,"\n SELECT ROUND(MIN(REPUTATION),2) AS MINRE..."
20,TASK 2,WHAT IS THE LENGTH OF THE BODY OF 5 MOST VIEWE...,"\n SELECT VIEWCOUNT AS MOSTVIEWED ,LEN_BODY..."
21,TASK 2,HOW MANY DIFFERENT LOCATIONS ARE THERE IN THE ...,\n SELECT COUNT(DISTINCT(LOCATION)) AS LOCA...
22,TASK 2,WHAT ARE THE TOP 5 LOCATIONS OF USERS,"\n SELECT LOCATION,COUNT(*) AS LOCATIONCOUN..."
23,TASK 2,RANK THE DAYS OF THE WEEK FROM HIGHEST TO LOWE...,\nSELECT CASE \n WHEN WEEKDAYNUMBE...
24,TASK 3,HOW MANY POSTS HAVE BEEN CREATED BY A USER THA...,\n SELECT COUNT(*) FROM USERS\n INNER JO...
25,TASK 3,"CONSIDERING ONLY THE USERS WITH AN ""ABOUTME,"" ...","\n SELECT OWNERUSERID,COUNT(*) \n FROM (S..."
26,TASK 3,NOT TAKING INTO ACCOUNT THE COMMENTCOUNT FIELD...,"\n SELECT POSTID,COUNT(COMMENTS.ID) AS NUMB..."
27,TASK 3,NOT TAKING INTO ACCOUNT THE COMMENTCOUNT FIELD...,"\n SELECT POSTID,(TOTALCOMSCORE + TOTALPOST..."
28,TASK 3,WHO ARE THE TOP 10 USERS WHO COMMENT THE MOST?,"\n SELECT USERID, USERS.REPUTATION,COUNT(PO..."

In [176]:
# Write the now deduped uppercase dataframe back to sqlite and replace the table
queries.to_sql('queries', con, if_exists='replace', index=False)

27

## Use Case

Now that we have this queries table, lets give you some ideas about how you would use it.

Suppose you wanted to find all of the queries where you did a GROUP BY:

In [177]:
%%sql
SELECT query
    FROM queries
        WHERE query LIKE '%GROUP BY%'

 * sqlite:///chatdata.db
Done.

[('\nSELECT ID, SUM(VIEWS) AS TOTALVIEWS\n    FROM USERS\n        GROUP BY ID\n            ORDER BY TOTALVIEWS DESC\n                LIMIT 5\n                ',),
 ('\n    SELECT SCORE ,COUNT(*) AS COUNT FROM POSTS \n    GROUP BY SCORE\n    ORDER BY COUNT DESC\n    LIMIT 5;\n    ',),
 ('\n    SELECT COMMENTCOUNT ,COUNT(*) AS COUNT FROM POSTS \n    GROUP BY COMMENTCOUNT\n    ORDER BY COUNT DESC\n    LIMIT 5;\n    ',),
 ('\n    SELECT COUNT(DISTINCT(LOCATION)) AS LOCATIONCOUNT FROM (\n    SELECT * FROM USERS \n        GROUP BY LOCATION\n    );\n    ',),
 ('\n    SELECT LOCATION,COUNT(*) AS LOCATIONCOUNT FROM USERS\n    GROUP BY LOCATION\n    ORDER BY LOCATIONCOUNT DESC\n    LIMIT 5;\n    ',),
 ("\nSELECT  CASE \n            WHEN WEEKDAYNUMBER = 0 THEN 'SUNDAY'\n            WHEN WEEKDAYNUMBER = 1 THEN 'MONDAY'\n            WHEN WEEKDAYNUMBER = ... (389 characters truncated) ... VIEWCOUNT) FROM POSTS)AS FLOAT) *100.0,2) AS PERCENTAGE_VIEWCOUNT \nFROM POSTS   \nGROUP BY WEEKDAYNUMBER\nORDER BY PERCENTAGE_VIEWCOUNT DESC);\n    ",),
 ('\n   SELECT OWNERUSERID,COUNT(*) \n    FROM (SELECT * FROM USERS\n    INNER JOIN POSTS ON POSTS.OWNERUSERID = USERS.ID\n    WHERE ABOUTME <> "NULL")\n    GROUP BY OWNERUSERID;\n    ',),
 ('\n    SELECT POSTID,COUNT(COMMENTS.ID) AS NUMBERCOMMENTS FROM POSTS\n    LEFT OUTER JOIN COMMENTS ON POSTS.ID = COMMENTS.POSTID\n    GROUP BY POSTID\n    ORDER BY NUMBERCOMMENTS DESC\n    LIMIT 10;\n    ',),
 ('\n    SELECT POSTID,(TOTALCOMSCORE + TOTALPOSTSCORE ) AS CUMMSCORE FROM\n    (SELECT POSTID,SUM(COMMENTS.SCORE) AS TOTALCOMSCORE ,SUM(POSTS.SCORE) AS ... (42 characters truncated) ...  JOIN COMMENTS ON POSTS.ID = COMMENTS.POSTID\n    GROUP BY POSTID\n    ORDER BY TOTALCOMSCORE DESC\n    LIMIT 10)\n    ORDER BY CUMMSCORE DESC;\n    ',),
 ('\n    SELECT USERID, USERS.REPUTATION,COUNT(POSTID) AS POSTSNUM, COUNT(TEXT) AS NUMCOMMENTS FROM USERS\n    LEFT OUTER JOIN COMMENTS ON USERS.ID = COMMENTS.USERID\n    GROUP BY USERID\n    ORDER BY POSTSNUM DESC\n    LIMIT 10;\n    ',)]

## Now Your Turn
Find the queries that have 'DISTINCT' in them. You can do it with the %sql command or with Pandas and sql.

<div style="background-color:lemonchiffon; border:1px solid; padding:5px; margin:5px; font-weight:bold"><font color="crimson">
TODO: Complete the following code cell
    </font></div>

In [178]:
%%sql
SELECT query 
    FROM queries
        WHERE query LIKE '%DISTINCT%'

 * sqlite:///chatdata.db
Done.

[('\n    SELECT COUNT(DISTINCT(LOCATION)) AS LOCATIONCOUNT FROM (\n    SELECT * FROM USERS \n        GROUP BY LOCATION\n    );\n    ',)]

# Close SQLite

It is good practise to close all relational databases as soon as you are finished updating them.

In [180]:
con.close()

# All Done!

Great job. You now have a good idea for how to use sql and pandas with sql. You can create your own databases from csv files and you can do extensive querying using sql. These are valuable skills that will take you a long ways in todays technological world.